AbdouSam/pic32mz-nolib/src/FreeRTOSConfig.h
/*
 *   FreeRTOS V9.0.0 - Copyright (C) 2016 Real Time Engineers Ltd.
 *   All rights reserved
 *
 *   VISIT http://www.FreeRTOS.org TO ENSURE YOU ARE USING THE LATEST VERSION.
 *
 ***************************************************************************
 *                                                                       *
 *    FreeRTOS provides completely free yet professionally developed,    *
 *    robust, strictly quality controlled, supported, and cross          *
 *    platform software that has become a de facto standard.             *
 *                                                                       *
 *    Help yourself get started quickly and support the FreeRTOS         *
 *    project by purchasing a FreeRTOS tutorial book, reference          *
 *    manual, or both from: http://www.FreeRTOS.org/Documentation        *
 *                                                                       *
 *    Thank you!                                                         *
 *                                                                       *
 ***************************************************************************
 *
 *   This file is part of the FreeRTOS distribution.
 *
 *   FreeRTOS is free software; you can redistribute it and/or modify it under
 *   the terms of the GNU General Public License (version 2) as published by
 *the
 *   Free Software Foundation >>!AND MODIFIED BY!<< the FreeRTOS exception.
 *
 *   >>!   NOTE: The modification to the GPL is included to allow you to
 *    !<<
 *   >>!   distribute a combined work that includes FreeRTOS without being
 *  !<<
 *   >>!   obliged to provide the source code for proprietary components
 *    !<<
 *   >>!   outside of the FreeRTOS kernel.
 *                                  !<<
 *
 *   FreeRTOS is distributed in the hope that it will be useful, but WITHOUT
 *ANY
 *   WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
 *   FOR A PARTICULAR PURPOSE.  Full license text is available from the
 *following
 *   link: http://www.freertos.org/a00114.html
 *
 *   1 tab == 4 spaces!
 *
 ***************************************************************************
 *                                                                       *
 *    Having a problem?  Start by reading the FAQ "My application does   *
 *    not run, what could be wrong?"                                     *
 *                                                                       *
 *    http://www.FreeRTOS.org/FAQHelp.html                               *
 *                                                                       *
 ***************************************************************************
 *
 *   http://www.FreeRTOS.org - Documentation, books, training, latest
 *versions,
 *   license and Real Time Engineers Ltd. contact details.
 *
 *   http://www.FreeRTOS.org/plus - A selection of FreeRTOS ecosystem
 *products,
 *   including FreeRTOS+Trace - an indispensable productivity tool, a DOS
 *   compatible FAT file system, and our tiny thread aware UDP/IP stack.
 *
 *   http://www.OpenRTOS.com - Real Time Engineers ltd license FreeRTOS to
 *High
 *   Integrity Systems to sell under the OpenRTOS brand.  Low cost OpenRTOS
 *   licenses offer ticketed support, indemnification and middleware.
 *
 *   http://www.SafeRTOS.com - High Integrity Systems also provide a safety
 *   engineered and independently SIL3 certified version for use in safety and
 *   mission critical applications that require provable dependability.
 *
 *   1 tab == 4 spaces!
 */

#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#include <xc.h>

/*-----------------------------------------------------------
* Application specific definitions.
*
* These definitions should be adjusted for your particular hardware and
* application requirements.
*
* THESE PARAMETERS ARE DESCRIBED WITHIN THE 'CONFIGURATION' SECTION OF THE
* FreeRTOS API DOCUMENTATION AVAILABLE ON THE FreeRTOS.org WEB SITE.
*
* See http://www.freertos.org/a00110.html.
*----------------------------------------------------------*/

#define configUSE_PREEMPTION                        1
#define configUSE_PORT_OPTIMISED_TASK_SELECTION     1
#define configUSE_TICKLESS_IDLE                     0
#define configCPU_CLOCK_HZ                          (200000000UL)
#define configPERIPHERAL_CLOCK_HZ                   (40000000UL)
#define configTICK_RATE_HZ                          ((TickType_t)1000)
#define configMAX_PRIORITIES                        (10UL)
#define configMINIMAL_STACK_SIZE                    (512)
#define configISR_STACK_SIZE                        (2048)
#define configSUPPORT_DYNAMIC_ALLOCATION            1
#define configSUPPORT_STATIC_ALLOCATION             0
#define configTOTAL_HEAP_SIZE                       ((size_t)98064)
#define configMAX_TASK_NAME_LEN                     (16)
#define configUSE_16_BIT_TICKS                      0
#define configIDLE_SHOULD_YIELD                     1
#define configUSE_MUTEXES                           1
#define configUSE_RECURSIVE_MUTEXES                 0
#define configUSE_COUNTING_SEMAPHORES               1
#define configUSE_TASK_NOTIFICATIONS                0
#define configQUEUE_REGISTRY_SIZE                   0
#define configUSE_QUEUE_SETS                        0
#define configUSE_TIME_SLICING                      1
#define configUSE_NEWLIB_REENTRANT                  0
#define configENABLE_BACKWARD_COMPATIBILITY         0
#define configUSE_TASK_FPU_SUPPORT                  0

/* Hook function related definitions. */
#define configUSE_IDLE_HOOK                         0
#define configUSE_TICK_HOOK                         0
#define configCHECK_FOR_STACK_OVERFLOW              0
#define configUSE_MALLOC_FAILED_HOOK                0

/* Run time and task stats gathering related definitions. */
#define configGENERATE_RUN_TIME_STATS               0
#define configUSE_TRACE_FACILITY                    0
#define configUSE_STATS_FORMATTING_FUNCTIONS        0

/* Co-routine related definitions. */
#define configUSE_CO_ROUTINES                       0
#define configMAX_CO_ROUTINE_PRIORITIES             2

/* Software timer related definitions. */
#define configUSE_TIMERS                            1
#define configTIMER_TASK_PRIORITY                   4
#define configTIMER_QUEUE_LENGTH                    5
#define configTIMER_TASK_STACK_DEPTH                1024
#define configUSE_DAEMON_TASK_STARTUP_HOOK          0

/* Misc */
#define configUSE_APPLICATION_TASK_TAG              0

/* Interrupt nesting behaviour configuration. */

/* The priority at which the tick interrupt runs.  This should probably be
 *kept at 1. */
#define configKERNEL_INTERRUPT_PRIORITY             1

/* The maximum interrupt priority from which FreeRTOS.org API functions can be
 * called.
 *  Only API functions that end in ...FromISR() can be used within interrupts.
 * */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY        3

/* Optional functions - most linkers will remove unused functions anyway. */
#define INCLUDE_vTaskPrioritySet                    1
#define INCLUDE_uxTaskPriorityGet                   1
#define INCLUDE_vTaskDelete                         1
#define INCLUDE_vTaskSuspend                        1
#define INCLUDE_vTaskDelayUntil                     1
#define INCLUDE_vTaskDelay                          1
#define INCLUDE_xTaskGetSchedulerState              0
#define INCLUDE_xTaskGetCurrentTaskHandle           0
#define INCLUDE_uxTaskGetStackHighWaterMark         1
#define INCLUDE_xTaskGetIdleTaskHandle              0
#define INCLUDE_eTaskGetState                       0
#define INCLUDE_xEventGroupSetBitFromISR            0
#define INCLUDE_xTimerPendFunctionCall              0
#define INCLUDE_xTaskAbortDelay                     0
#define INCLUDE_xTaskGetHandle                      0

#endif /* FREERTOS_CONFIG_H */
